Revised documentation
